Revit 2027 API
ParameterTypeId.PlumbingFixturesSupplyPipe Property
 "Supply Pipe"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlumbingFixturesSupplyPipe { get; }
Public Shared ReadOnly Property PlumbingFixturesSupplyPipe As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlumbingFixturesSupplyPipe {
	ForgeTypeId^ get ();
}
static member PlumbingFixturesSupplyPipe : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace